# GetSequence Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlphanumericRevisionSettings..::..GetSequence Method
AlphanumericRevisionSettings Class See Also
---
Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<string> GetSequence()
```

Visual Basic
---
```text
Public Function GetSequence As IList(Of String)
```

Visual C++
---
```text
public:
IList<String^>^ GetSequence()
```

# See Also
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace